In [93]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from scipy.spatial.distance import euclidean
from sklearn.cluster import MeanShift
%matplotlib inline

In [94]:
data = pd.read_csv('checkins.csv', sep = '|', skipinitialspace=True)

In [95]:
data.head()

,id,user_id,venue_id,latitude,longitude,created_at
0,---------+---------+----------+---------------...,NaN,NaN,NaN,NaN,NaN
1,984301,2041916.0,5222.0,NaN,NaN,2012-04-21 17:39:01
2,984222,15824.0,5222.0,38.895112,-77.036366,2012-04-21 17:43:47
3,984315,1764391.0,5222.0,NaN,NaN,2012-04-21 17:37:18
4,984234,44652.0,5222.0,33.800745,-84.410520,2012-04-21 17:43:43

In [96]:
data = data.drop(0)

In [97]:
data.columns = data.columns.str.replace(' ', '')

In [98]:
data.columns.tolist()

['id', 'user_id', 'venue_id', 'latitude', 'longitude', 'created_at']

In [99]:
data.head()

        id    user_id  venue_id   latitude  longitude           created_at
1  984301   2041916.0    5222.0        NaN        NaN  2012-04-21 17:39:01
2  984222     15824.0    5222.0  38.895112 -77.036366  2012-04-21 17:43:47
3  984315   1764391.0    5222.0        NaN        NaN  2012-04-21 17:37:18
4  984234     44652.0    5222.0  33.800745 -84.410520  2012-04-21 17:43:43
5  984249   2146840.0    5222.0        NaN        NaN  2012-04-21 17:42:58

In [100]:
data.dropna(axis=0, how='any', subset=['latitude', 'longitude'], inplace=True)

In [102]:
data = data.iloc[:100000]

In [107]:
data=np.array(data[['latitude', 'longitude']])

In [110]:
clustering = MeanShift(bandwidth=0.1).fit(data)

In [124]:
y = clustering.labels_

In [128]:
index = []
points = []
for i in range(max(clustering.labels_)):
    z = (y == i).sum()
    index.append(i)
    points.append(z)

In [161]:
index

1278

In [137]:
fin_list = []
i = 0
for row in zip(index,points):
    if points[i]>15:
        fin_list.append(zip(index,points)[i])
    i+=1

In [183]:
centeres_city = np.array([[33.751277, -118.188740], [25.867736, -80.324116], [51.503016, -0.075479], [52.378894, 4.885084], [39.366487, 117.036146], [-33.868457, 151.205134]])

In [174]:
clustering.cluster_centers_

array([[  40.7177164 ,  -73.99183542],
       [  33.44943805, -112.00213969],
       [  33.44638027, -111.90188756],
       ...,
       [  46.7323875 , -117.0001651 ],
       [  29.6899563 ,  -95.8996757 ],
       [  31.3787916 ,  -95.3213317 ]])

In [224]:
list_of_dist = []
list_of_dist_only = []
list_of_index_only = []
for i in range(len(centeres_city)):
    for index in indexes:
        dist = euclidean(centeres_city[i], clustering.cluster_centers_[index])
        list_of_dist.append([index,dist])
        list_of_dist_only.append(dist)
        list_of_index_only.append(index)

In [236]:
min_dist = sorted(list_of_dist_only)[:20]

In [241]:
list_of_cont_index = []
for dist in min_dist:
    for i in range(len(list_of_dist_only)):
        if dist == list_of_dist_only[i]:
            list_of_cont_index.append(i)

In [242]:
list_of_cont_index

[3375,
 2151,
 995,
 1244,
 51,
 622,
 759,
 685,
 87,
 42,
 285,
 908,
 119,
 648,
 27,
 11,
 32,
 751,
 17,
 47]

In [243]:
for index in list_of_cont_index:
    print list_of_index_only[index]

413
373
405
58
51
29
166
92
87
42
285
315
119
55
27
11
32
158
17
47

In [244]:
clustering.cluster_centers_[413]

array([ -33.86063043,  151.20477593])